Revit 2024 API
FamilyManager.SortParameters Method
 Sorts the family parameters according to the desired sort order.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public void SortParameters(
	ParametersOrder order
)
Visual Basic
Public Sub SortParameters ( _
	order As ParametersOrder _
)
Visual C++
public:
void SortParameters(
	ParametersOrder order
)
Parameters
order
Type: Autodesk.Revit.DB.ParametersOrder
 The desired sort order.
Remarks
The sort only affects visible parameters within the same parameter group.
Parameters that belong to different groups will remain separated, and the groups' order will not be affected.
The sort is a one-time operation and when new parameters are added they will not be automatically sorted.
Examples
CopyC#
private void DisplayParametersInAscendingOrder(Document familyDoc)
{
    FamilyManager familyManager = familyDoc.FamilyManager;
    familyManager.SortParameters(ParametersOrder.Ascending);
}
CopyVB.NET
Private Sub DisplayParametersInAscendingOrder(familyDoc As Document)
    Dim familyManager As FamilyManager = familyDoc.FamilyManager
    familyManager.SortParameters(ParametersOrder.Ascending)
End Sub
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when this family is a Rebar Shape family which doesn't support parameters reorder.
See Also
FamilyManager Class
Autodesk.Revit.DB Namespace